Repository: Vitaliy-1/JATSParserPlugin
Catalog: locale/*/locale.po
Languages: bg, cs_cz, fr_fr, pt_br, uk_ua

# plugins.generic.jatsParser.displayName
source: JATSParser Plugin
bg: Плъгин JATSParser
cs_cz: Plugin JATSParser
fr_fr: Plugiciel JATSParser
uk_ua: JATSParser плагін

# plugins.generic.jatsParser.article.fulltext.availableLocale
source: Full-text of the article is available for this locale:
bg: Пълният текст на статията е достъпен за този език:
cs_cz: Pro tuto lokalizaci je k dispozici plný text článku:
fr_fr: Le texte intégral de l'article est disponible dans cette langue :
pt_br: O texto completo do artigo está disponível para este idioma:
uk_ua: Повний текст статті доступний для такої мови:

# plugins.generic.jatsParser.workflow.settings
source: JATS Parser Settings
bg: Настройки на JATS Parser
cs_cz: Nastavení JATS parseru
fr_fr: Paramètres du JATS Parser
pt_br: Configurações do Parser JATS
uk_ua: Налаштування JATS парсера

# plugins.generic.jatsParser.settings.description
source: JATSParser plugin settings menu
bg: Меню с настройки на плъгина JATSParser
cs_cz: Nabídka nastavení zásuvného modulu JATSParser
fr_fr: Menu de paramétrage du plugiciel JATSParser
pt_br: Menu de configurações do plugin JATSParser
uk_ua: Форма налаштувань для плагіна JATSParser

# plugins.generic.jatsParser.settings.covert.pdf
source: Activate JATS XML to PDF conversion
bg: Активиране преобразуването на JATS XML в PDF
cs_cz: Aktivace převodu JATS XML do PDF
pt_br: Ative a conversão de JATS XML para PDF
uk_ua: Активувати перетворення JATS XML в PDF

# plugins.generic.jatsParser.galley.import
source: Import of JATS XML galleys
bg: Импортиране на JATS XML типографии
cs_cz: Import sazebnic JATS XML
fr_fr: Import des épreuves JATS XML
pt_br: Importação de composições XML JATS
uk_ua: Завантаження гранок JATS XML

# plugins.generic.jatsParser.galley.import.title
source: Import full-text from galleys
bg: Импортиране на пълен текст от типографии
cs_cz: Import plných textů ze sazebnic
fr_fr: Extraire le texte intégral à partir des épreuves
pt_br: Importar texto completo das composições
uk_ua: Завантаження повного тексту із гранок

# plugins.generic.jatsParser.galley.import.description
source: This options allows to save JATS XML galleys as a full-text across all publications in the journal. Import is omitted if a publication already has full-text for a given galley. Import starts immediately after saving the form
bg: Тази опция позволява да се запазят JATS XML типографии като пълен текст във всички публикации в списанието. Импортирането се пропуска, ако публикацията вече има пълен текст за дадена типография. Импортирането започва веднага след запазване на формата
cs_cz: Tato volba umožňuje ukládat sazebnice JATS XML jako plné texty všech publikací v časopise. Import se vynechá, pokud publikace již obsahuje plný text pro danou sazebnici. Import se spustí okamžitě po uložení formuláře
fr_fr: Cette option permet d'extraire le texte intégral des épreuves JATS XML pour toutes les publications du journal. Les épreuves ayant déjà donné lieu à une extraction de texte intégral ne sont pas traitées. Le traitement débute aussitôt le formulaire validé.
pt_br: Esta opção permite salvar as composições JATS XML como texto completo em todas as publicações da revista. A importação é omitida se uma publicação já tiver texto completo para uma determinada composição. A importação começa imediatamente após salvar o formulário
uk_ua: Ця опція дозволяє завантажити повний текст для всіх публікацій із гранок у форматі JATS XML. Завантаження не відбудеться якщо публікація вже має повний текст. Імпорт почнеться одразу після збереження цієї форми

# plugins.generic.jatsParser.publication.jats.fulltext
source: Full Text
bg: Пълен текст
cs_cz: Plný text
fr_fr: Texte intégral
pt_br: Texto Completo
uk_ua: Повний текст

# plugins.generic.jatsParser.publication.jats.fulltext.success
source: Full-text upload successful
bg: Успешно качване на пълен текст
cs_cz: Úspěšné nahrání plného textu
fr_fr: Réussite du chargement du texte intégral
pt_br: Carregamento de texto completo bem sucedido
uk_ua: Повний текст успішно завантажився

# plugins.generic.jatsParser.publication.jats.label
source: Create full text
bg: Създаване на пълен текст
cs_cz: Vytvořit plný text
fr_fr: Extraction du texte intégral
pt_br: Criar texto completo
uk_ua: Створити повний текст

# plugins.generic.jatsParser.publication.jats.description
source: Select a production ready file in JATS XML format to create the full text.
bg: Изберете готов за производство файл във формат JATS XML, за да създадете пълния текст.
cs_cz: Pro vytvoření plného textu vyberte soubor připravený k produkci ve formátu JATS XML.
fr_fr: Sélectionnez le fichier publiable au format JATS XML d'où extraire le texte intégral.
pt_br: Selecione um arquivo pronto para editoração no formato JATS XML para criar o texto completo.
uk_ua: Виберіть зверстаний файл у форматі JATS XML для створення повного тексту.

# plugins.generic.jatsParser.publication.jats.descriptionEmpty
source: The list of JATS XML files is empty. Please, upload the file to the production stage and it will appear below for full-text generation.
bg: Списъкът с JATS XML файлове е празен. Моля, качете файла в производствения етап и той ще се появи по-долу за генериране на пълен текст.
cs_cz: Seznam souborů JATS XML je prázdný. Nahrajte prosím soubor do produkční fáze a zobrazí se níže pro generování plného textu.
fr_fr: Aucun fichier JATS XML à afficher. Intégrez un fichier à l'étape "Production" et il apparaîtra ci-dessous pour extraction du texte intégral.
pt_br: A lista de arquivos XML JATS está vazia. Por favor, faça o upload do arquivo para a fase de editoração e ele aparecerá abaixo para geração de texto completo.
uk_ua: Список файлів у форматі JATS XML порожній. Будь ласка, завантажте файл на стадії верстки для того, щоб він став доступний для створення повного тексту.

# plugins.generic.jatsParser.publication.jats.references.label
source: Retrieve references from JATS XML?
bg: Извличане на препратки от JATS XML?
cs_cz: Získání referencí z JATS XML?
fr_fr: Récupérer les références à partir du JATS XML ?
pt_br: Recuperar referências do JATS XML?
uk_ua: Взяти бібліографічний список з JATS XML файлу?

# plugins.generic.jatsParser.publication.jats.references.description
source: Reference list will be retrieved from JATS XML and saved as a part of the publication. If references are already included into the publication, they are going to be rewritten.
bg: Референтният списък ще бъде извлечен от JATS XML и запазен като част от публикацията. Ако препратките вече са включени в публикацията, те ще бъдат пренаписани.
cs_cz: Seznam referencí bude načten z JATS XML a uložen jako součást publikace. Pokud jsou již reference součástí publikace, budou přepsány.
fr_fr: Les références seront extraites du JATS XML et sauvegardées au sein de la publication. Les références déjà intégrées à la publication seront écrasées.
pt_br: A lista de referência será recuperada do JATS XML e salva como parte da publicação. Se as referências já estiverem incluídas na publicação, elas serão reescritas.
uk_ua: Бібліографічний список буде взятий із JATS XML та збережений як частина публікації. Всі посилання, вже включені у публікацію, будуть переписані.

# plugins.generic.jatsParser.publication.jats.pdf.label
source: Create PDF Galley?
bg: Създаване на PDF типография?
cs_cz: Vytvořit PDF sazebnici?
fr_fr: Créer une épreuve PDF ?
pt_br: Criar Composição PDF?
uk_ua: Створити PDF гранку?

# plugins.generic.jatsParser.style.chicago-author-date
source: Chicago
bg: Чикаго

# plugins.generic.jatsParser.style.harvard-cite-them-right
source: Harvard
bg: Харвард

# plugins.generic.jatsParser.style.turabian-fullnote-bibliography
source: Turabian
bg: Турабиан

# plugins.generic.jatsParser.style.vancouver
source: Vancouver
bg: Ванкувър

# plugins.generic.jatsParser.style.custom
source: Other citation style formats
bg: Други формати за стил на цитиране
cs_cz: Další formáty citačních stylů
fr_fr: Autres formats de référence
pt_br: Outros formatos de estilo de citação
uk_ua: Інші стилі цитувань

# plugins.generic.jatsParser.style.label
source: e.g.: american-medical-association
bg: напр.: американска-медицинска-асоциация
cs_cz: např.: american-medical-association
fr_fr: ex. : american-medical-association
pt_br: ex.: american-medical-association
uk_ua: наприклад: american-medical-association

# plugins.generic.jatsParser.publication.jats.links.label
source: Format in-text links to references?
bg: Форматиране на връзки в текст към препратки?
cs_cz: Formátovat odkazů v textu na reference?
fr_fr: Mettre en forme les liens vers les références trouvés dans le texte ?
pt_br: Formatar links no texto para referências?
uk_ua: Відформатувати посилання на бібліографічний список в тексті статті?

# plugins.generic.jatsParser.settings.convert.pdf
source: Enable PDF conversion
bg: Активиране на конвертирането на PDF
cs_cz: Povolení převodu do formátu PDF
fr_fr: Activer la conversion du JATS XML en PDF
pt_br: Ativar conversão de PDF

# plugins.generic.jatsParser.description
source: The plugin transforms JATS XML into HTML and PDF for viewing on the journal's front-end
bg: Плъгинът трансформира JATS XML в HTML и PDF за преглед в предния край на списанието
cs_cz: Zásuvný modul transformuje JATS XML do HTML a PDF pro zobrazení ve front-endu časopisu
fr_fr: Ce plugiciel convertit un document JATS XML en HTML et en PDF affichables sur le site web de la revue
pt_br: O plugin transforma JATS XML em HTML e PDF para visualização no front-end da revista
uk_ua: Перетворює JATS XML в HTML та PDF для відображення на сторінці галереї

# plugins.generic.jatsParser.article.fulltext.availableLocales
source: Full-text of the article is available for these locales:
bg: Пълният текст на статията е достъпен за тези езици:
cs_cz: Pro tyto jazyky je k dispozici plný text článku:
fr_fr: Le texte intégral de l'article est disponible dans ces langues :
pt_br: O texto completo do artigo está disponível para estes idiomas:
uk_ua: Повний текст статті доступний для таких мов:

# plugins.generic.jatsParser.style.description
source: The style format for references parsed by the plugin. For other styles, visit <a target="_blank" href="https://github.com/citation-style-language/styles">CSL repository</a> to see if it's supported.
bg: Форматът на стила за препратки, анализирани от плъгина. За други стилове посетете <a target="_blank" href="https://github.com/citation-style-language/styles">CSL хранилището</a>, за да видите дали се поддържа.
cs_cz: Formát stylu pro odkazy analyzované zásuvným modulem. Pro ostatní styly navštivte <a target="_blank" href="https://github.com/citation-style-language/styles">úložiště CSL</a> a zjistěte, zda jsou podporovány.
fr_fr: Le format des références extraites par le plugiciel. Pour les autres formats supportés, voir le <a target="_blank" href="https://github.com/citation-style-language/styles">CSL repository</a>.
pt_br: O formato de estilo para referências parseadas pelo plugin. Para outros estilos, visite o <a target="_blank" href="https://github.com/citation-style-language/styles">repositório CSL</a> para ver se é compatível.
uk_ua: Стиль цитування для посилань, який буде використовуватись плагіном. Для інших стилів цитувань зверніть увагу на <a target="_blank" href="https://github.com/citation-style-language/styles">CSL репозиторій</a>, щоб упевнитись що він підтримується.
